//
//  PromptDatas.swift
//  yesMarathon-App
//
//  Created by A S on 2025/06/11.
//

/// YES挑戦用のプロンプトデータ
public let prompts: [[String]] = [
    // 恋愛... 1
    [
        "26字以下で1日完結し、恋愛に関するYES挑戦を簡単に提案して",
        "26字以下で1日完結、恋愛でできる小さな行動を教えて",
        "恋愛を前向きにするYES挑戦を26字以下で提案して"
    ],
    // 対人関係... 2
    [
        "26字以下で1日完結し、日常の人間関係でYES行動を促す挑戦を提案して",
        "26字以下で1日完結、身近な人との関係を良くする小さな挑戦を教えて",
        "人間関係を良くするYES行動を、26字以下で1日完結する形で提案して"
    ],
    // 趣味開拓... 3
    [
        "26字以下で1日完結し、趣味に関する簡単なYES挑戦を提案して",
        "26字以下で1日でできる趣味の小さな挑戦を教えて",
        "趣味の世界を広げるYES行動を26字以下で1日完結する形で提案して"
    ],
    // 行動... 4
    [
        "26字以下で1日完結し、日常でYESと言える簡単な行動を提案して",
        "26字以下で1日完結、生活の中でできる小さな行動の挑戦を教えて",
        "日常生活の行動で前向きになれるYES挑戦を26字以下で提案して"
    ],
    // 学び... 5
    [
        "26字以下で1日完結し、学びに関する小さなYES挑戦を提案して",
        "26字以下で1日でできる新しい知識やスキルの挑戦を教えて",
        "学びを深めるYES行動を26字以下で1日完結する形で提案して"
    ],
    // 冒険... 6
    [
        "26字以下で1日完結し、冒険心を刺激するYES挑戦を提案して",
        "26字以下で1日完結、日常に冒険を取り入れる小さな挑戦を教えて",
        "新しい挑戦や冒険を促すYES行動を26字以下で提案して"
    ]
]
